<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/4bc3c0a9-2e68-4b31-ae4e-78562f9a36dd/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ecs.aws_ecs_task_definition.app_task_definition has been deleted
  - resource "aws_ecs_task_definition" "app_task_definition" {
      - arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-history:7" -> null
        id                       = "staging-history"
        tags                     = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_eip.nat[0] has changed
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-00d85da85a5ee9b92"
      ~ tags                 = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (1 unchanged element hidden)
        }
      ~ tags_all             = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          - "Namespace"        = "walletconnect" -> null
          + "ProvisionedBy"    = "Terraform"
          - "Stage"            = "staging" -> null
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] has changed
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-0f22103e67a0f8858"
      ~ tags                 = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (1 unchanged element hidden)
        }
      ~ tags_all             = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          - "Namespace"        = "walletconnect" -> null
          + "ProvisionedBy"    = "Terraform"
          - "Stage"            = "staging" -> null
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-095a8e9e1e84e5423"
      ~ tags             = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          - "Namespace"        = "walletconnect" -> null
          + "ProvisionedBy"    = "Terraform"
          - "Stage"            = "staging" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-02ad02a1d7bd626c2"
      ~ tags             = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          - "Namespace"        = "walletconnect" -> null
          + "ProvisionedBy"    = "Terraform"
          - "Stage"            = "staging" -> null
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] has changed
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0a54f4fbc62a07f83"
      ~ tags                                           = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          - "Namespace"        = "walletconnect" -> null
          + "ProvisionedBy"    = "Terraform"
          - "Stage"            = "staging" -> null
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] has changed
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0be8f48e6b047db7c"
      ~ tags                                           = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          - "Namespace"        = "walletconnect" -> null
          + "ProvisionedBy"    = "Terraform"
          - "Stage"            = "staging" -> null
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] has changed
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-06274970559b4ec00"
      ~ tags                                           = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          - "Namespace"        = "walletconnect" -> null
          + "ProvisionedBy"    = "Terraform"
          - "Stage"            = "staging" -> null
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] has changed
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-04be3d082ab96a054"
      ~ tags                                           = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          - "Namespace"        = "walletconnect" -> null
          + "ProvisionedBy"    = "Terraform"
          - "Stage"            = "staging" -> null
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] has changed
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-09aee6302088ed50c"
      ~ tags                                           = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          - "Namespace"        = "walletconnect" -> null
          + "ProvisionedBy"    = "Terraform"
          - "Stage"            = "staging" -> null
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] has changed
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0b63dd9c124ced7c6"
      ~ tags                                           = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "ProvisionedBy"    = "Terraform"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          + "Application"      = "history"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          - "Namespace"        = "walletconnect" -> null
          + "ProvisionedBy"    = "Terraform"
          - "Stage"            = "staging" -> null
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_kms_alias.analytics_bucket will be destroyed
  # (because aws_kms_alias.analytics_bucket is not in configuration)
  - resource "aws_kms_alias" "analytics_bucket" {
      - arn            = "arn:aws:kms:eu-central-1:898587786287:alias/docdb/walletconnect-staging-history" -> null
      - id             = "alias/docdb/walletconnect-staging-history" -> null
      - name           = "alias/docdb/walletconnect-staging-history" -> null
      - target_key_arn = "arn:aws:kms:eu-central-1:898587786287:key/d5d5f85a-7a58-4b83-a879-169512d257cf" -> null
      - target_key_id  = "d5d5f85a-7a58-4b83-a879-169512d257cf" -> null
    }

  # aws_kms_key.docdb_encryption will be destroyed
  # (because aws_kms_key.docdb_encryption is not in configuration)
  - resource "aws_kms_key" "docdb_encryption" {
      - arn                                = "arn:aws:kms:eu-central-1:898587786287:key/d5d5f85a-7a58-4b83-a879-169512d257cf" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - deletion_window_in_days            = 10 -> null
      - description                        = "walletconnect-staging-history" -> null
      - enable_key_rotation                = true -> null
      - id                                 = "d5d5f85a-7a58-4b83-a879-169512d257cf" -> null
      - is_enabled                         = true -> null
      - key_id                             = "d5d5f85a-7a58-4b83-a879-169512d257cf" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Id        = "key-default-1"
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::898587786287:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "Name"      = "walletconnect-staging-history"
          - "Namespace" = "walletconnect"
          - "Stage"     = "staging"
        } -> null
    }

  # aws_prometheus_workspace.prometheus will be updated in-place
  ~ resource "aws_prometheus_workspace" "prometheus" {
        id                  = "ws-86adde76-f99a-4773-847b-00e9b4384c0a"
      ~ tags                = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all            = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-staging-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
        }
        # (3 unchanged attributes hidden)
    }

  # module.dns.aws_acm_certificate.domain_certificate will be updated in-place
  ~ resource "aws_acm_certificate" "domain_certificate" {
        id                        = "arn:aws:acm:eu-central-1:898587786287:certificate/44749651-e494-45f7-85e2-2a3d28035b8c"
      ~ tags                      = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all                  = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-staging-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_cloudwatch_log_group.cluster_logs will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "cluster_logs" {
        id                = "staging-history_logs"
        name              = "staging-history_logs"
      ~ tags              = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all          = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-staging-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
        }
        # (3 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_cluster.app_cluster will be updated in-place
  ~ resource "aws_ecs_cluster" "app_cluster" {
        id                 = "arn:aws:ecs:eu-central-1:898587786287:cluster/staging-history"
        name               = "staging-history"
      ~ tags               = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all           = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-staging-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
        }
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-history/staging-history-service"
        name                               = "staging-history-service"
      ~ tags                               = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all                           = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-staging-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
        }
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-history:8" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition will be created
  + resource "aws_ecs_task_definition" "app_task_definition" {
      + arn                      = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::898587786287:role/staging-history-ecs-task-execution-role"
      + family                   = "staging-history"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Name"      = "walletconnect-staging-history"
          + "Namespace" = "walletconnect"
          + "Stage"     = "staging"
        }
      + task_role_arn            = "arn:aws:iam::898587786287:role/staging-history-ecs-task-execution-role"

      + runtime_platform {
          + operating_system_family = "LINUX"
        }
    }

  # module.ecs.aws_iam_policy.otel will be updated in-place
  ~ resource "aws_iam_policy" "otel" {
        id        = "arn:aws:iam::898587786287:policy/staging-history-otel"
        name      = "staging-history-otel"
      ~ tags      = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all  = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-staging-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
        }
        # (4 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_role.ecs_task_execution_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_execution_role" {
        id                    = "staging-history-ecs-task-execution-role"
        name                  = "staging-history-ecs-task-execution-role"
      ~ tags                  = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all              = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-staging-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
        }
        # (8 unchanged attributes hidden)
    }

  # module.ecs.aws_lb.application_load_balancer will be updated in-place
  ~ resource "aws_lb" "application_load_balancer" {
        id                               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/staging-history-load-balancer/ee7b166c5506d45d"
        name                             = "staging-history-load-balancer"
      ~ tags                             = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all                         = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-staging-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
        }
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_lb_listener.listener will be updated in-place
  ~ resource "aws_lb_listener" "listener" {
        id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-history-load-balancer/ee7b166c5506d45d/bd949208fb5ee274"
      ~ tags              = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all          = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-staging-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_lb_listener.listener-http will be updated in-place
  ~ resource "aws_lb_listener" "listener-http" {
        id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-history-load-balancer/ee7b166c5506d45d/b9775952a10b0db3"
      ~ tags              = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all          = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-staging-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_lb_target_group.target_group will be updated in-place
  ~ resource "aws_lb_target_group" "target_group" {
        id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-history-target-group/60fd6869a679865a"
        name                               = "staging-history-target-group"
      ~ tags                               = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all                           = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-staging-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
        }
        # (14 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ecs.aws_security_group.app_ingress will be updated in-place
  ~ resource "aws_security_group" "app_ingress" {
        id                     = "sg-066c06edc4e6de651"
        name                   = "staging-history-ingress-to-app"
      ~ tags                   = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all               = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-staging-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
        }
        # (7 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.lb_ingress will be updated in-place
  ~ resource "aws_security_group" "lb_ingress" {
        id                     = "sg-0c7b01ccdd112b0ac"
        name                   = "staging-history-lb-ingress"
      ~ tags                   = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "Name"             = "history" -> null
          - "ProvisionedBy"    = "Terraform" -> null
        }
      ~ tags_all               = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          ~ "Name"             = "history" -> "walletconnect-staging-history"
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keystore-docdb.aws_docdb_cluster.docdb_primary will be created
  + resource "aws_docdb_cluster" "docdb_primary" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backup_retention_period         = 1
      + cluster_identifier              = "staging-history-keystore-docdb-primary-cluster"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "staging-history-keystore-docdb-private-subnet-group"
      + enabled_cloudwatch_logs_exports = [
          + "audit",
        ]
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_username                 = "gilgamesh"
      + port                            = 27017
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = true
      + storage_encrypted               = true
      + tags_all                        = {
          + "Name"      = "walletconnect-staging-history"
          + "Namespace" = "walletconnect"
          + "Stage"     = "staging"
        }
      + vpc_security_group_ids          = (known after apply)
    }

  # module.keystore-docdb.aws_docdb_cluster_instance.docdb_instances[0] will be created
  + resource "aws_docdb_cluster_instance" "docdb_instances" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = (known after apply)
      + cluster_identifier              = (known after apply)
      + db_subnet_group_name            = (known after apply)
      + dbi_resource_id                 = (known after apply)
      + enable_performance_insights     = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = (known after apply)
      + id                              = (known after apply)
      + identifier                      = "staging-history-keystore-docdb-primary-instance-0"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.r5.large"
      + kms_key_id                      = (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + promotion_tier                  = 0
      + publicly_accessible             = (known after apply)
      + storage_encrypted               = (known after apply)
      + tags_all                        = {
          + "Name"      = "walletconnect-staging-history"
          + "Namespace" = "walletconnect"
          + "Stage"     = "staging"
        }
      + writer                          = (known after apply)
    }

  # module.keystore-docdb.aws_docdb_subnet_group.private_subnets will be created
  + resource "aws_docdb_subnet_group" "private_subnets" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "staging-history-keystore-docdb-private-subnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-06274970559b4ec00",
          + "subnet-0a54f4fbc62a07f83",
          + "subnet-0be8f48e6b047db7c",
        ]
      + tags_all    = {
          + "Name"      = "walletconnect-staging-history"
          + "Namespace" = "walletconnect"
          + "Stage"     = "staging"
        }
    }

  # module.keystore-docdb.aws_kms_key.docdb_encryption will be created
  + resource "aws_kms_key" "docdb_encryption" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = (known after apply)
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "Name"      = "walletconnect-staging-history"
          + "Namespace" = "walletconnect"
          + "Stage"     = "staging"
        }
    }

  # module.keystore-docdb.aws_secretsmanager_secret.master_password will be created
  + resource "aws_secretsmanager_secret" "master_password" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "staging-history-keystore-docdb-master-password"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "Name"      = "walletconnect-staging-history"
          + "Namespace" = "walletconnect"
          + "Stage"     = "staging"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.keystore-docdb.aws_secretsmanager_secret_version.master_password will be created
  + resource "aws_secretsmanager_secret_version" "master_password" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.keystore-docdb.aws_security_group.service_security_group will be created
  + resource "aws_security_group" "service_security_group" {
      + arn                    = (known after apply)
      + description            = "Allow ingress from the application"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow outbound traffic from the DocDB cluster"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow inbound traffic to the DocDB cluster"
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
            },
        ]
      + name                   = "staging-history-keystore-docdb-service"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Name"      = "walletconnect-staging-history"
          + "Namespace" = "walletconnect"
          + "Stage"     = "staging"
        }
      + vpc_id                 = "vpc-004131c2efe4d188f"
    }

  # module.keystore-docdb.random_password.master_password will be created
  + resource "random_password" "master_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-00d85da85a5ee9b92"
      ~ tags                 = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all             = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-00bec4bdcd8f0828f"
      ~ tags     = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-0f22103e67a0f8858"
      ~ tags                 = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all             = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-095a8e9e1e84e5423"
      ~ tags             = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-02ad02a1d7bd626c2"
      ~ tags             = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0a54f4fbc62a07f83"
      ~ tags                                           = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0be8f48e6b047db7c"
      ~ tags                                           = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-06274970559b4ec00"
      ~ tags                                           = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-04be3d082ab96a054"
      ~ tags                                           = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-09aee6302088ed50c"
      ~ tags                                           = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0b63dd9c124ced7c6"
      ~ tags                                           = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-004131c2efe4d188f"
      ~ tags                                 = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          - "ProvisionedBy"    = "Terraform" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all                             = {
          - "Application"      = "history" -> null
          - "Env"              = "staging" -> null
          - "EnvironmentGroup" = "walletconnect" -> null
          + "Namespace"        = "walletconnect"
          - "ProvisionedBy"    = "Terraform" -> null
          + "Stage"            = "staging"
            # (1 unchanged element hidden)
        }
        # (16 unchanged attributes hidden)
    }

Plan: 9 to add, 25 to change, 2 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition has been deleted%0A  - resource "aws_ecs_task_definition" "app_task_definition" {%0A      - arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-history:7" -> null%0A        id                       = "staging-history"%0A        tags                     = {}%0A        # (11 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.vpc.aws_eip.nat[0] has changed%0A  ~ resource "aws_eip" "nat" {%0A        id                   = "eipalloc-00d85da85a5ee9b92"%0A      ~ tags                 = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (1 unchanged element hidden)%0A        }%0A      ~ tags_all             = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          - "Namespace"        = "walletconnect" -> null%0A          + "ProvisionedBy"    = "Terraform"%0A          - "Stage"            = "staging" -> null%0A            # (1 unchanged element hidden)%0A        }%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_nat_gateway.this[0] has changed%0A  ~ resource "aws_nat_gateway" "this" {%0A        id                   = "nat-0f22103e67a0f8858"%0A      ~ tags                 = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (1 unchanged element hidden)%0A        }%0A      ~ tags_all             = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          - "Namespace"        = "walletconnect" -> null%0A          + "ProvisionedBy"    = "Terraform"%0A          - "Stage"            = "staging" -> null%0A            # (1 unchanged element hidden)%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table.private[0] has changed%0A  ~ resource "aws_route_table" "private" {%0A        id               = "rtb-095a8e9e1e84e5423"%0A      ~ tags             = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (1 unchanged element hidden)%0A        }%0A      ~ tags_all         = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          - "Namespace"        = "walletconnect" -> null%0A          + "ProvisionedBy"    = "Terraform"%0A          - "Stage"            = "staging" -> null%0A            # (1 unchanged element hidden)%0A        }%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table.public[0] has changed%0A  ~ resource "aws_route_table" "public" {%0A        id               = "rtb-02ad02a1d7bd626c2"%0A      ~ tags             = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (1 unchanged element hidden)%0A        }%0A      ~ tags_all         = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          - "Namespace"        = "walletconnect" -> null%0A          + "ProvisionedBy"    = "Terraform"%0A          - "Stage"            = "staging" -> null%0A            # (1 unchanged element hidden)%0A        }%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.private[0] has changed%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-0a54f4fbc62a07f83"%0A      ~ tags                                           = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (2 unchanged elements hidden)%0A        }%0A      ~ tags_all                                       = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          - "Namespace"        = "walletconnect" -> null%0A          + "ProvisionedBy"    = "Terraform"%0A          - "Stage"            = "staging" -> null%0A            # (2 unchanged elements hidden)%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.private[1] has changed%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-0be8f48e6b047db7c"%0A      ~ tags                                           = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (2 unchanged elements hidden)%0A        }%0A      ~ tags_all                                       = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          - "Namespace"        = "walletconnect" -> null%0A          + "ProvisionedBy"    = "Terraform"%0A          - "Stage"            = "staging" -> null%0A            # (2 unchanged elements hidden)%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.private[2] has changed%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-06274970559b4ec00"%0A      ~ tags                                           = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (2 unchanged elements hidden)%0A        }%0A      ~ tags_all                                       = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          - "Namespace"        = "walletconnect" -> null%0A          + "ProvisionedBy"    = "Terraform"%0A          - "Stage"            = "staging" -> null%0A            # (2 unchanged elements hidden)%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.public[0] has changed%0A  ~ resource "aws_subnet" "public" {%0A        id                                             = "subnet-04be3d082ab96a054"%0A      ~ tags                                           = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (2 unchanged elements hidden)%0A        }%0A      ~ tags_all                                       = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          - "Namespace"        = "walletconnect" -> null%0A          + "ProvisionedBy"    = "Terraform"%0A          - "Stage"            = "staging" -> null%0A            # (2 unchanged elements hidden)%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.public[1] has changed%0A  ~ resource "aws_subnet" "public" {%0A        id                                             = "subnet-09aee6302088ed50c"%0A      ~ tags                                           = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (2 unchanged elements hidden)%0A        }%0A      ~ tags_all                                       = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          - "Namespace"        = "walletconnect" -> null%0A          + "ProvisionedBy"    = "Terraform"%0A          - "Stage"            = "staging" -> null%0A            # (2 unchanged elements hidden)%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.public[2] has changed%0A  ~ resource "aws_subnet" "public" {%0A        id                                             = "subnet-0b63dd9c124ced7c6"%0A      ~ tags                                           = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          + "ProvisionedBy"    = "Terraform"%0A            # (2 unchanged elements hidden)%0A        }%0A      ~ tags_all                                       = {%0A          + "Application"      = "history"%0A          + "Env"              = "staging"%0A          + "EnvironmentGroup" = "walletconnect"%0A          - "Namespace"        = "walletconnect" -> null%0A          + "ProvisionedBy"    = "Terraform"%0A          - "Stage"            = "staging" -> null%0A            # (2 unchanged elements hidden)%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_kms_alias.analytics_bucket will be destroyed%0A  # (because aws_kms_alias.analytics_bucket is not in configuration)%0A  - resource "aws_kms_alias" "analytics_bucket" {%0A      - arn            = "arn:aws:kms:eu-central-1:898587786287:alias/docdb/walletconnect-staging-history" -> null%0A      - id             = "alias/docdb/walletconnect-staging-history" -> null%0A      - name           = "alias/docdb/walletconnect-staging-history" -> null%0A      - target_key_arn = "arn:aws:kms:eu-central-1:898587786287:key/d5d5f85a-7a58-4b83-a879-169512d257cf" -> null%0A      - target_key_id  = "d5d5f85a-7a58-4b83-a879-169512d257cf" -> null%0A    }%0A%0A  # aws_kms_key.docdb_encryption will be destroyed%0A  # (because aws_kms_key.docdb_encryption is not in configuration)%0A  - resource "aws_kms_key" "docdb_encryption" {%0A      - arn                                = "arn:aws:kms:eu-central-1:898587786287:key/d5d5f85a-7a58-4b83-a879-169512d257cf" -> null%0A      - bypass_policy_lockout_safety_check = false -> null%0A      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null%0A      - deletion_window_in_days            = 10 -> null%0A      - description                        = "walletconnect-staging-history" -> null%0A      - enable_key_rotation                = true -> null%0A      - id                                 = "d5d5f85a-7a58-4b83-a879-169512d257cf" -> null%0A      - is_enabled                         = true -> null%0A      - key_id                             = "d5d5f85a-7a58-4b83-a879-169512d257cf" -> null%0A      - key_usage                          = "ENCRYPT_DECRYPT" -> null%0A      - multi_region                       = false -> null%0A      - policy                             = jsonencode(%0A            {%0A              - Id        = "key-default-1"%0A              - Statement = [%0A                  - {%0A                      - Action    = "kms:*"%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - AWS = "arn:aws:iam::898587786287:root"%0A                        }%0A                      - Resource  = "*"%0A                      - Sid       = "Enable IAM User Permissions"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - tags                               = {} -> null%0A      - tags_all                           = {%0A          - "Name"      = "walletconnect-staging-history"%0A          - "Namespace" = "walletconnect"%0A          - "Stage"     = "staging"%0A        } -> null%0A    }%0A%0A  # aws_prometheus_workspace.prometheus will be updated in-place%0A  ~ resource "aws_prometheus_workspace" "prometheus" {%0A        id                  = "ws-86adde76-f99a-4773-847b-00e9b4384c0a"%0A      ~ tags                = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "staging" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          - "Name"             = "history" -> null%0A          - "ProvisionedBy"    = "Terraform" -> null%0A        }%0A      ~ tags_all            = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "staging" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          ~ "Name"             = "history" -> "walletconnect-staging-history"%0A          + "Namespace"        = "walletconnect"%0A          - "ProvisionedBy"    = "Terraform" -> null%0A          + "Stage"            = "staging"%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.dns.aws_acm_certificate.domain_certificate will be updated in-place%0A  ~ resource "aws_acm_certificate" "domain_certificate" {%0A        id                        = "arn:aws:acm:eu-central-1:898587786287:certificate/44749651-e494-45f7-85e2-2a3d28035b8c"%0A      ~ tags                      = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "staging" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          - "Name"             = "history" -> null%0A          - "ProvisionedBy"    = "Terraform" -> null%0A        }%0A      ~ tags_all                  = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "staging" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          ~ "Name"             = "history" -> "walletconnect-staging-history"%0A          + "Namespace"        = "walletconnect"%0A          - "ProvisionedBy"    = "Terraform" -> null%0A          + "Stage"            = "staging"%0A        }%0A        # (14 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_cloudwatch_log_group.cluster_logs will be updated in-place%0A  ~ resource "aws_cloudwatch_log_group" "cluster_logs" {%0A        id                = "staging-history_logs"%0A        name              = "staging-history_logs"%0A      ~ tags              = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "staging" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          - "Name"             = "history" -> null%0A          - "ProvisionedBy"    = "Terraform" -> null%0A        }%0A      ~ tags_all          = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "staging" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          ~ "Name"             = "history" -> "walletconnect-staging-history"%0A          + "Namespace"        = "walletconnect"%0A          - "ProvisionedBy"    = "Terraform" -> null%0A          + "Stage"            = "staging"%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_cluster.app_cluster will be updated in-place%0A  ~ resource "aws_ecs_cluster" "app_cluster" {%0A        id                 = "arn:aws:ecs:eu-central-1:898587786287:cluster/staging-history"%0A        name               = "staging-history"%0A      ~ tags               = {%0A          - "Application"      = "history" -> null%0A          - "Env"              = "staging" -> null%0A          - "EnvironmentGroup" = "walletconnect" -> null%0A          - "Name"             = "history" 
...

```

</details>

*Action: `pull_request`*